//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		CrushEffect.cs
//!
//! @summary	スタートに関するC#スクリプト
//!
//! @date		2019.05.28
//!
//! @author		伊藤瑠花
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/


// 名前空間の省略 ===========================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

// クラスの定義 =============================================================
public class CrushEffect : MonoBehaviour
{
    // <メンバ変数>
    // パーティクルシステム
    private ParticleSystem m_particle;


    // メンバ関数の定義 =====================================================
    //--------------------------------------------------------------------
    //! @summary   初期化処理
    //!
    //! @parameter [void] なし
    //!
    //! @return    なし
    //--------------------------------------------------------------------
    void Start()
    {
        // パーティクルシステムの取得
        m_particle = GetComponent<ParticleSystem>();
        m_particle.Stop();

    }

    //--------------------------------------------------------------------
    //! @summary   更新処理
    //!
    //! @parameter [void] なし
    //!
    //! @return    なし
    //--------------------------------------------------------------------
    void Update()
    {
    }

    //--------------------------------------------------------------------
    //! @summary   パーティクルシステム発生の処理
    //!
    //! @parameter [void] なし
    //!
    //! @return    なし
    //--------------------------------------------------------------------
    public void StartEffect(Vector3 vec)
    {
        // パーティクルシステムを発生させる
        transform.position = vec;
        m_particle.Play();
    }
}
